import itertools
import json
import time
from os import write

#  Стоп слова
blacklist = ["Я ", "Я", "Я,", " я ", "просчитан", "Не переводите", "проблема", "пересчитайте", "отдан", "предупреждал", "считан", "Я на месте", "Отдал", "Закрыт", "Удалите", "Админам", "читайте",
             "не себе", "Вам", "Как взять заказ", "Не себе", "якнуть", "Ты ", "могу", "Бан",
             "добро пожаловать","CTR_club", "Могу", "якнул", "идет расчет", "Добрый день", "готов", "Возьму",
             "требования к профилю", "нарушение правил", "@", "Подработка", "заберу", "???", "?"]

#
districts = {
    "central": ["Москва", " мск", "москв", "Россош", "моск", "Воронеж", "россошь", "Внуково", "Галиевка(Богучарский район)", "Ярослав", "Рязан", "Тула", "Губкин", "Шебекин",
                "Алексеевка", "Новый Оскол","Липецк", "Калуга", "Тамбов", "Курск", "Брянск", "Белгород", "ближняя игуменка",
                "Орёл", "Орел" "Владимир", "Иваново", "Кострома", "Смоленск", "Тверь", "Череповец",
                "Старый Оскол", "Муром", "Балашиха", "Шереметьево", "Домодедово", "Подольск", "Химки",
                "Клинцы", "Владимир", "Ковров", "Александров", "Гусь-Хрустальный",  "Железногорск", "Елец",
                "Химки", "Мытищи", "Люберцы", "Красногорск", "Электросталь", "Коломна", "Одинцово", "Мичуринск", "Весёлая Лопань",
                "Твер", "Новомосковск", "Рыбинск", "Шереметьев", "Калужск", "Борисоглебск", "Орловская", "Серпухов", "лизиновка","Старая Нелидовка", "Валуйки", "Богучар"],

    "ЛДНР": ['красный луч', "Беловодск", "Новоахтырка", "Лесное(лутугиский район)", "Луганск", "Лисичанск", "Стаханов", 'лнр', "Острогожск", "лиски", "днр", "лднр", "Донецк",
             'алчевск', "Авдеевка", "Макеевка", "Мариуполь","Амвросиевка", 'Бахмут', "Горловка", 'северодонецк',
             'лисичанск', 'ровеньки', 'рубежное','краснодон', "Кременная", "Горловка", "Краматорск", "Антрацит",
             "Славянск", "лутугино", "Романовка", "Енакиево", "Константиновка", "Артёмовск", "Ясиноватая", "Волноваха",
             "Старобельск",  "Новобелая", "Старобельский", "Сватовский", "Волновахск"],

    "zap_her": [
            "Запорожье", "Запорожская", "Мелитополь", "Бердянск", "Энергодар", "Токмак", "Пологи", "Днепрорудное", "Херсон",
            "Новая Каховка", "Каховка", "Алёшки", "Геническ", "Скадовск", "Голая Пристань", "Васильевка"],

    "sev_zapad": ["Архангельск", "Северодвинск", "Котлас", "Вельск", "Нарьян-Мар", "Вологда", "Череповец", "Калининград",
                  "Багратионовск", "Зеленоградск", "Петрозаводск", "Кондопога", "Костомукша", "Сегежа", "Сыктывкар",
                  "Воркута", "Ухта", "Всеволожск", "Карелия", "Ленинград", "Мурманск", "Ненецкий", "Новгород", "Псковск",
                  "Санкт-Петербург", "Питер", "спб", "Псков", "Пулково", "Санкт-Питербург"],

    "yug": ["Адыгея", "Майкоп", "Адыгейск", "симф", "Астрахань", "Ахтубинск", "Волгоград", "Волжский", "Камышин", "Калмыкия",
            "Элиста", "Краснодар", "Сочи", "Адлер","Армавир", "Новороссийск", "Анапа", "Белореченск", "Геленджик", "Ейск",
            "Кропоткин", "Лабинск", "Тихорецк", "Тимашёвск", "Туапсе", "Крым", "Симферополь", "Керч", "Евпатория", "Ялта",
            "Феодосия", "Джанкой", "Алушта", "Алупка", "Ростов", "Ростов-на-Дону", "Таганрог", "Батайск", "Волгодонск",
            "Новочеркасск", "Новошахтинск", "Шахты", "Азов", "Гуково", "Севастополь", "Инкерман", "аксай", "абинск", "новоозерное",
            "кпп Армянск", "Егорлыкская", "Есентуки", "Ессентуки"],


    "sev_kav": ["Дагестан", "Чечн", "чеченск", "Ингушетия", "Кабардино", "Карачаево", "Черкесская", "Северная Осетия", "Алания", "Чеченс",
                "Чечня", "Ставрополь", "Пятигорск", "Нальчик", "Грозный", "Махачкала", "Владикавказ", "Хасавюрт", "Каспийск",
                "Дербент", "Кисловодск", "Назрань", "Ессентуки", "Невинномысск", "Черкесск", "Михайловск", "Минеральные Воды",
                "Буйнакск", "Гудермес", "Урус-Мартан", "Сунжа", "Избербаш", "Кабардино", "Балкария", "Беслан", "Дагестанские Огни",
                "Курчалой", "Карачаевск", "Черкесия", "Черкесск", "Чегет"],


    "privolz": ["Уфа", "Стерлитамак", "Нефтекамск", "Октябрьский", "Салават", "Белебей", "Туймазы", "Сибай", "Кумертау",
                "Киров", "Кирово-Чепецк", "Йошкар-Ола", "Волжск", "Мордовия", "Ковылкино", "Рузаевка", "Нижегородская",
                "Новгород", "Нижний Новгород", "Арзамас", "Дзержинск", "Балахна", "Саров", "Павлово", "Кстово", "Выкса",
                "Оренбург", "Орск", "Бузулук", "Новотроицк", "Пенза", "Заречный", "Кузнецк", "Перм", "Березники", "Краснокамск",
                "Кунгур", "Соликамск", "Чайковский", "Лысьва", "Самар", "Тольятти", "Новокуйбышевск", "Сызрань", "Жигулёвск",
                "Чапаевск", "Октябрьск", "Саратов", "Балаково", "Энгельс", "Балашов", "Вольск", "Аткарск", "Татарстан",
                "Казан", "Набережные Челны", "Альметьевск", "Нижнекамск", "Бугульма", "Елабуга", "Зеленодольск", "Чистополь",
                "Лениногорск", "Ижевск", "Воткинск", "Сарапул", "Глазов", "Ульяновск", "Димитровград", "Чувашия", "Чебоксары",
                "Новочебоксарск", "Алатырь", "Канаш"],

    "ural": ["Курганская", "Свердлов", "Тюменская", "Ханты-Мансийск", "Челябинск", "Ямало-Ненецкий", "Екатеринбург",
             "екб", "Тюмень", "Магнитогорск", "Сургут", "Нижний Тагил", "Тагил", "Курган", 'Нижневартовск', "Каменск-Уральский",
             "Златоуст", "Первоуральск", "Нефтеюганск", "Миасс", "Копейск", "Новый Уренгой", "Тобольск", "Ноябрьск", "Серов",
             "Новоуральск", "Озёрск", "Верхняя Пышма", "Троицк", "Шадринск", "Ишим", "Нягань", "Когалым", "Ревда",
             "Башкир", "урал"],


    "sibir": ["Горно-Алтайск", "Барнаул", "Бийск", "Рубцовск", "Новоалтайск", "Алтай", "Иркутск", "Ангарск", "Братск",
              "Усолье-Сибирское", "Усть-Илимск", "Черемхово", "Кемеров", "Новокузнецк", "Прокопьевск", "Междуреченск",
              "Ленинск-Кузнецкий", "Киселёвск", "Юрга", "Анжеро-Судженск", "Белово", "Красноярск", "Ачинск", "Норильск", "Железногорск",
              "Зеленогорск", "Лесосибирск", "сибир", "Минусинск", "Назарово", "Новосибирск", "Бердск", "Искитим", " Омск",
              "Томск", "колпашево", "Северск", "Тува", "Кызыл", "тыва ", "Хакасия", "Абакан", "Черногорск", "Саяногорск"],


    "dalnevostok": ["Благовещенск", "Белогорск", "Тында", "Петропавловск-Камчатский", "Уссурийск", "Находка", "Артём", "Южно-Сахалинск",
                    "Комсомольск-на-Амуре", "Владивосток", "Хабаровск", "Улан-Удэ", "бурятия", "Якутск", "Якут", "Северобайкальск",
                    "Биробиджан", "Краснокаменск", "Магадан", "Чита ", "Арсеньев", "Нерюнгри", "Амурск", "Артём" , "Сахалин"]
}

# text = """"""
#
#
# refine_text = ""
#
#
# for keyword in itertools.chain.from_iterable(districts.values()):
#     if f"{keyword.lower()}" in text.lower():
#         print(keyword)




# blacklist2 = ["Я ", "Я", "Я,", "отдан", "Я на месте", "Отдал", "Закрыт",
#              "не себе", "Вам", "Как взять заказ", "Не себе", "якнуть",
#              "добро пожаловать"]
#

# text = """
#
# на ближайщее время а.колпашево
# б.томск
#
# """
# if not any(keyword in text.replace("СЕГОДНЯ", "") for keyword in blacklist):
#     print("Проверку на стоп слова прошли")
#
# else:
#     print("Проверку на стоп слова НЕ прошли")
#
#
# str_city = []
# for keyword in itertools.chain.from_iterable(districts.values()):
#     if keyword.lower() in text.lower():
#         str_city.append(keyword.lower())
#
#
# res_city = [str_city[0], str_city[-1]]
# print(res_city)
#
# positions = {city: text.lower().find(city) for city in res_city if text.lower().find(city) != -1}
# first_city = min(positions, key=positions.get) if positions else None
# print(first_city)
#
#
#
#
#
# if any(keyword.lower() in text.lower()
#        for keyword in itertools.chain.from_iterable(districts.values())):
#     print(text)
#
#
# for i in itertools.chain.from_iterable(districts.values()):
#     print(i)